{
  "Understanding How COVID-19 Vaccines Work": "What You Need to Know\nCOVID-19 vaccines are safe and effective.\nYou may have side effects after vaccination, but these are normal.\nIt typically takes two weeks after you are fully vaccinated for the body to build protection (immunity) against the virus that causes COVID-19.\nIf you are not vaccinated, find a vaccine. Keep taking all precautions until you are fully vaccinated.\nIf you are fully vaccinated, you can resume activities that you did prior to the pandemic. Learn more about what you can do when you have been fully vaccinated.\n\n\n\nThe Immune System—the Body’s Defense Against Infection\nTo understand how COVID-19 vaccines work, it helps to first look at how our bodies fight illness. When germs, such as the virus that causes COVID-19, invade our bodies, they attack and multiply. This invasion, called an infection, is what causes illness. Our immune system uses several tools to fight infection. Blood contains red cells, which carry oxygen to tissues and organs, and white or immune cells, which fight infection. Different types of white blood cells fight infection in different ways:\n\nMacrophages are white blood cells that swallow up and digest germs and dead or dying cells. The macrophages leave behind parts of the invading germs, called “antigens”. The body identifies antigens as dangerous and stimulates antibodies to attack them.\nB-lymphocytes are defensive white blood cells. They produce antibodies that attack the pieces of the virus left behind by the macrophages.\nT-lymphocytes are another type of defensive white blood cell. They attack cells in the body that have already been infected.\n\nThe first time a person is infected with the virus that causes COVID-19, it can take several days or weeks for their body to make and use all the germ-fighting tools needed to get over the infection. After the infection, the person’s immune system remembers what it learned about how to protect the body against that disease.\nThe body keeps a few T-lymphocytes, called “memory cells,” that go into action quickly if the body encounters the same virus again. When the familiar antigens are detected, B-lymphocytes produce antibodies to attack them. Experts are still learning how long these memory cells protect a person against the virus that causes COVID-19.\nHow COVID-19 Vaccines Work\nCOVID-19 vaccines help our bodies develop immunity to the virus that causes COVID-19 without us having to get the illness.\n\n\n\n\nDifferent types of vaccines work in different ways to offer protection. But with all types of vaccines, the body is left with a supply of “memory” T-lymphocytes as well as B-lymphocytes that will remember how to fight that virus in the future.\nIt typically takes a few weeks after vaccination for the body to produce T-lymphocytes and B-lymphocytes. Therefore, it is possible that a person could be infected with the virus that causes COVID-19 just before or just after vaccination and then get sick because the vaccine did not have enough time to provide protection.\nSometimes after vaccination, the process of building immunity can cause symptoms, such as fever. These symptoms are normal and are signs that the body is building immunity.\nLearn more about getting your vaccine.\n\n\nTypes of Vaccines\nCurrently, there are three main types of COVID-19 vaccines that are authorized and recommended or undergoing large-scale (Phase 3) clinical trials in the United States.\n\n\nBelow is a description of how each type of vaccine prompts our bodies to recognize and protect us from the virus that causes COVID-19. None of these vaccines can give you COVID-19.\n\nmRNA vaccines contain material from the virus that causes COVID-19 that gives our cells instructions for how to make a harmless protein that is unique to the virus. After our cells make copies of the protein, they destroy the genetic material from the vaccine. Our bodies recognize that the protein should not be there and build T-lymphocytes and B-lymphocytes that will remember how to fight the virus that causes COVID-19 if we are infected in the future.\nProtein subunit vaccines include harmless pieces (proteins) of the virus that causes COVID-19 instead of the entire germ. Once vaccinated, our bodies recognize that the protein should not be there and build T-lymphocytes and antibodies that will remember how to fight the virus that causes COVID-19 if we are infected in the future.\nVector vaccines contain a modified version of a different virus than the one that causes COVID-19. Inside the shell of the modified virus, there is material from the virus that causes COVID-19. This is called a “viral vector.” Once the viral vector is inside our cells, the genetic material gives cells instructions to make a protein that is unique to the virus that causes COVID-19. Using these instructions, our cells make copies of the protein. This prompts our bodies to build T-lymphocytes and B-lymphocytes that will remember how to fight that virus if we are infected in the future.\n\nSome COVID-19 Vaccines Require More Than One Shot\n\n\nTo be fully vaccinated, you will need two shots of some COVID-19 vaccines.\n\nTwo shots: If you get a COVID-19 vaccine that requires two shots, you are considered fully vaccinated two weeks after your second shot. Pfizer-BioNTech and Moderna COVID-19 vaccines require two shots.\nOne Shot: If you get a COVID-19 vaccine that requires one shot, you are considered fully vaccinated two weeks after your shot. Johnson &amp; Johnson’s Janssen COVID-19 vaccine only requires one shot.\n\nIf it has been less than two weeks since your shot, or if you still need to get your second shot, you are NOT fully protected. Keep taking steps to protect yourself and others until you are fully vaccinated (two weeks after your final shot).\nLearn how to find a COVID-19 vaccine so you can get it as soon as you can.\n\n\n\r\n\t\r\n\nhand holding medical light iconFor Healthcare ProfessionalsCOVID-19 Clinical Resources"
}
